/*
โครงสร้างโปรเจค
    node_modules    เก็บโมดูลหรือไลบรารี่ที่ทำงานในโปรเจค
    public          เก็บไฟล์ public ต่างๆ เช่น รูปภาพ และ index.html
    src             สำหรับเก็บ Component หรือโครงสร้างของแอพลิเคชั่น
    package.json    เกก็บข้อมูลต่างๆ รวมถึง package ที่จะใช้ทำงานในโปรเจค

/public/index.html
    ไฟล์ที่ใช้สำหรับการแสดงผลข้อมูลบนเบราเซอร์ จะรันผ่านไฟล์ index.html สิ่งที่เราสนใจใน index.html ก็คือคำสั่งส่วนที่อยู่ใน <body> ตรงส่วนของ <div id="root"></div>

/src/App.js
    เป็นไฟล์หลักในการรันแอพพลิเคชั่นขึ้นมา โดยนำ่สวนประกอบต่างๆ มาประกอบกันแล้วนำไปแสดงผลในเบราเซอร์

/src/index.js
    เป็นไฟล์ที่เชื่อมการทำงานระหว่าง App.js กับ index.html
    
*/